kms254/Mustang-Dash-Test/boards/variants/H755ZI_Q_MULE/variant_NUCLEO_H743ZI.h
#ifdef ARDUINO_NUCLEO_H743ZI2
  #define NUM_DIGITAL_PINS      119
#else
  #define NUM_DIGITAL_PINS      117
#endif
#define NUM_DUALPAD_PINS        2
#define NUM_ANALOG_INPUTS       28

// On-board LED pin number
#ifndef LED_BUILTIN
  #define LED_BUILTIN           PB0  // LD1
#endif
#define LED_GREEN               LED_BUILTIN
#ifdef ARDUINO_NUCLEO_H743ZI2
  #define LED_YELLOW            PE1  // LD2
#else
  #define LED_BLUE              PB7  // LD2
#endif
#define LED_RED                 PB14 // LD3

// On-board user button
#ifndef USER_BTN
  #define USER_BTN              PC13
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
  #define TIMER_TONE            TIM6
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO           TIM7
#endif

// UART Definitions
#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  3 //Connected to ST-Link
#endif

// Serial pin used for console (ex: ST-Link)
// Required by Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         PD9
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         PD8
#endif

// HSE default value is 25MHz in HAL
// HSE_BYPASS is 8MHz
#ifndef HSE_BYPASS_NOT_USED
  #define HSE_VALUE             8000000
#endif

// Extra HAL modules
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
#if !defined(HAL_ETH_MODULE_DISABLED)
  #define HAL_ETH_MODULE_ENABLED
#endif
#if !defined(HAL_QSPI_MODULE_DISABLED)
  #define HAL_QSPI_MODULE_ENABLED
#endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif

/* Repo-local variant copy for the NUCLEO-H755ZI-Q mule (board3_mule env).
 * The -Q board wires VCORE DIRECT-SMPS. The stock USE_PWR_LDO_SUPPLY is
 * consumed by ExitRun0Mode(), which runs from the startup file BEFORE main()
 * and before the sketch's SystemClock_Config override -- and the H7 supply
 * config is WRITE-ONCE until the next power-on reset, so the first post-POR
 * boot latches LDO and hangs forever at the ACTVOSRDY wait (2-instruction
 * spin, empty stack, looks bricked; warm reset does NOT clear it, only POR).
 * Warm-reset boots inherit whatever the last POR latched, which is how this
 * survived every bench boot until the first real power cycle (2026-08-12).
 * USE_PWR_DIRECT_SMPS_SUPPLY compiles ExitRun0Mode to a no-op under the H743
 * headers (no SMPS macro), leaving the sketch's SystemClock_Config to make
 * the first -- correct, direct-SMPS -- supply write after POR. */
#if defined(DASH_MULE_H755Q)
  #define USE_PWR_DIRECT_SMPS_SUPPLY
#else
  #define USE_PWR_LDO_SUPPLY
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #define SERIAL_PORT_MONITOR     Serial
  #define SERIAL_PORT_HARDWARE    Serial
#endif
